---
kind: type
id: T:Autodesk.Revit.Exceptions.CentralModelContentionException
source: html/ad511076-c435-23c1-5720-1205c4ed28b9.htm
---
# Autodesk.Revit.Exceptions.CentralModelContentionException

The exception thrown when a central model is busy (locked)
and the operation is canceled.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CentralModelContentionException : CentralModelException
```